src/Documents/ИС_Ozon_УпаковкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Ozon_УпаковкаТоваров</Name>
			<Comment>ИнфоСофт Власова И.С. 22.03.24 УА #71520</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПечатиЭтикеток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобиратьПозаказно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПечатиШтрихкодов</Name>
					<Comment>ИнфоСофт Стояк Ю.К. 15.04.2025 УА #98648</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_НастройкиПечати</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикеткаРаспечатана</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИС_Ozon_УпаковкаТоваров/Forms/ФормаОтправления/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Для Каждого Элемент Из Параметры.НоменклатураОтправлений Цикл
		НоваяСтрока = НоменклатураКУпаковке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418 

//+ ИнфоСофт Заварин К.В. 14.03.25 УА #89418
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	ОчиститьСообщения();
	
	ДанныеШтрихкода = Новый Структура; 
	
	ДанныеШтрихкода.Вставить("ФорматBase64", Ложь); 
	ДанныеШтрихкода.Вставить("Штрихкод", СокрЛП(Данные));
	ДанныеШтрихкода.Вставить("Количество", 1);
	
	ИС_MP_МаркировкаКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода); 
	
	ПараметрыСканирования = ИС_MP_МаркировкаКлиент.ПараметрыСканирования(ЭтаФорма);  
	
	РезультатОбработкиШтрихкода = ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования);	
		
		ВыполнитьПроверкуНаПечатьOzon(РезультатОбработкиШтрихкода);
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 14.03.25 УА #89418 

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	 КопироватьДанныеФормы(ВладелецФормы.Объект, Объект); 
	 
КонецПроцедуры //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Заварин К.В. 13.03.25 УА #89418
&НаСервере
Функция ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения = Неопределено)

	Возврат ИС_MP_Маркировка.ОбработатьШтрихкод(ДанныеШтрихкода, ПараметрыСканирования, КэшированныеЗначения, ЭтаФорма.УникальныйИдентификатор);	
			
КонецФункции //- ИнфоСофт Заварин К.В. 13.03.25 УА #89418 

//+ ИнфоСофт Заварин К.В. 14.03.25 УА #89418
&НаКлиенте
Процедура ВыполнитьПроверкуНаПечатьOzon(РезультатОбработкиШтрихкода)
	
	ДанныеШтрихкода = РезультатОбработкиШтрихкода.ДанныеШтрихкода; 	
	
	СтрокаТЗДанныеСборки = Неопределено;   
	
	Для Каждого Строка Из НоменклатураКУпаковке Цикл
		Если Строка.Номенклатура = ДанныеШтрихкода.Номенклатура И Строка.Характеристика = ДанныеШтрихкода.Характеристика И Строка.Количество > Строка.КоличествоФакт Тогда
			СтрокаТЗДанныеСборки = Строка;
			Строка.КоличествоФакт = Строка.КоличествоФакт + 1;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если СтрокаТЗДанныеСборки = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'По отсканированному штрихкоду не найдено доступного заказа для печати этикетки.'"));
		Возврат;
	КонецЕсли;	
	
	ЭтаФорма.Отправление = СтрокаТЗДанныеСборки.Отправление;
	
    ВыполнитьПроверкуНаОкончаниеОбработки();
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 14.03.25 УА #89418

//+ ИнфоСофт Заварин К.В. 14.03.25 УА #89418
&НаКлиенте
Процедура ВыполнитьПроверкуНаОкончаниеОбработки() 
	
	ПрерватьВыполнение = Истина;
	
	Для Каждого Строка Из НоменклатураКУпаковке Цикл
		Если Строка.Количество > Строка.КоличествоФакт Тогда
			ПрерватьВыполнение = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если ПрерватьВыполнение Тогда
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("ТоварыПодобраны", Истина);
		ПараметрыЗакрытия.Вставить("Отправление", ЭтаФорма.Отправление);
		ЭтаФорма.Закрыть(ПараметрыЗакрытия);	
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Заварин К.В. 14.03.25 УА #89418	

#КонецОбласти
